---
type: GroupLoadOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# GroupLoadOptions

`Autodesk.Revit.DB.GroupLoadOptions` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | GroupLoadOptions | 2024 | `public GroupLoadOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetDuplicateTypeNamesHandler | 2024 | `public IDuplicateTypeNamesHandler GetDuplicateTypeNamesHandler ()` |
| Method | SetDuplicateTypeNamesHandler | 2024 | `public void SetDuplicateTypeNamesHandler ( IDuplicateTypeNamesHandler handler )` |
| Property | IncludeAttachedDetails | 2024 | `public bool IncludeAttachedDetails { get ; set ; }` |
| Property | IncludeGrids | 2024 | `public bool IncludeGrids { get ; set ; }` |
| Property | IncludeLevels | 2024 | `public bool IncludeLevels { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | ReplaceDuplicatedGroups | 2024 | `public bool ReplaceDuplicatedGroups { get ; set ; }` |